practice/app/controllers/artworks_controller.rb

    def index
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
        else
            artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks"

    def show
        artworks = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]