practice/app/controllers/artworks_controller.rb

    def index
        artworks = Artwork.find(params[:user_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]