practice/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
        comments = Comment.all

INSERT INTO "comments" ("artwork_id", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artwork_id", 1], ["author_id", 1], ["body", "first"], ["created_at", "2023-09-28 17:53:35.684468"], ["updated_at", "2023-09-28 17:53:35.684468"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save