practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # creates a 'users' object containing all the users in the database
        users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # creates a 'user' object by finding a user in the database with the specified id
        user = User.find(params[:id])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "charlie"], ["created_at", "2023-09-28 13:25:46.518147"], ["updated_at", "2023-09-28 13:25:46.518147"]]
---
    def create
        # creates a new user based on the allowed parameters
        user = User.new(user_params)


        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "rob2"], ["updated_at", "2023-09-28 18:31:21.042610"], ["id", 3]]
---
    def update
        # creates a 'user' object by finding a user in the database with the specified id
        user = User.find(params[:id])
        if user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        user = User.find_by(id: params[:id])
        if user && user.destroy