practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rob"], ["LIMIT", 1]]
---
    def index
        # creates a 'users' object containing all the users in the database

        # renders that object into individual json objects to be further manipulated in the views
# debugger
        if params.has_key?(:query)
            user = User.find_by(username: params[:query])